# 1. Базовый образ, с которого мы начинаем
FROM python:3.12-slim

# 2. Полезная переменная окружения
ENV PYTHONUNBUFFERED=1

# 3. Создаем и устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# 4. Копируем файл с зависимостями и устанавливаем их (для кэширования)
COPY requirements.txt .
RUN pip install -r requirements.txt

# 5. Копируем весь остальной код нашего проекта
COPY . .

# 6. Команда, которая будет запущена при старте контейнера
CMD ["python", "manage.py", "runserver", "0.0.0.0:8000"]